import './styles.scss';

const AboutUs = () => {
    return (
        <section className="about__section">
            <div className="container">
                <h2 className="section__title">Про розробника</h2>
                <p className="about__section-text">
                    <p>Привіт!</p>
                    Мене звати Андрій Мирошниченко і я FrontEnd-розробник.
                    <p>Переконаний, що кожна сучасна компанія, яка орієнтується на досягнення найвищих стратегічних цілей, прагне мати у своєму арсеналі кваліфікованих працівників із природним вмінням бути продуктивними в усьому. Знайти таких людей дуже складно, але я думаю, що належу до їх числа. 
                    Про це свідчить: 
                    ⁃ свідомий вибір професії;
                    ⁃ шалена мотивація;
                    ⁃ бажання вчитися та бути корисним.
                    </p>
                    <p>Маючи на меті бачити у своїй команді порядну людину, віддану професії до кінця, з великим бажанням розвиватися, ваш вибір має зосередитись на мені. 
                    І що більше у вас в активі буде таких людей, тим успішнішою буде кожна ваша справа.
                    </p>
                    <p>Перелік стеку технологій, які я використовую у своїй роботі, досить широкий. Основні з них: HTML, CSS, JS, REST API, AJAX бібліотеки та фреймворки, як-от ReactJS, Redux, Material-UI, Bootstrap, JEST, препроцесори Sass, Less. Активно використовую в роботі  збірники проектів, такі як NPM, GULP, Yarn, а також систему контролю версій GIT. Також у моєму арсеналі є й інші технології, якими я користуюсь. 
                       Паралельно займаюсь вивченням таких бібліотек і фрейворків, як-от TypeScript,NodeJS, ExpressJS, VueJS, Vuex, Typescript.</p>
                    <p>З найліпшими побажаннями, Андрій Мирошниченко.</p>
                </p>
                <a href="https://drive.google.com/file/d/1OQqbA3joMuuq2bbD_F5PrFzWgaK8DMO5/view?usp=share_link"><p className='footer_title'>Скачати резюме розробника</p></a>
            </div>
        </section>
    )
}

export default AboutUs;